Documents/SEMESTER 4/psikolog_register/app/Controllers/PsikologController.php

SELECT *
FROM `psikolog`
ORDER BY `id` DESC
---
    public function index()
{
    $model = new $this->psikologModel(); // Menggunakan properti psikologModel untuk membuat objek model
    $data = [
        'message' => 'success',
        'data_psikolog' =>$model->orderby('id', 'DESC')->findAll(), // Menggunakan objek model yang telah dibuat
    ];

INSERT INTO `psikolog` (`nama`, `email`, `password`, `no_telepon`, `alamat`, `kelamin`, `sertifikat`) VALUES ('Mahoraga', 'laurent98@gmail.com', '190298736565', '081234156276', 'Madiun', 'Laki Laki', '1710836147_b616e55964d053a5c064.png')
---
    public function create()
    {
        $rules = [
            'nama'          => 'required',
            'email'         => 'required',
            'password'      => 'required',
            'no_telepon'    => 'required',
            'alamat'        => 'required',
            'kelamin'       => 'required',
            'sertifikat'    => 'uploaded[sertifikat]|max_size[sertifikat,5120]|is_image[sertifikat]|mime_in[sertifikat,image/jpg,image/jpeg,image/png]'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        //PROSES UPLOAD
        $sertifikat = $this->request->getFile('sertifikat');
        if ($sertifikat->isValid() && !$sertifikat->hasMoved()) {
            //direktori penyimpanan
            $uploadPath = 'uploads'; // Misalnya, simpan di direktori writable/uploads
            if (!is_dir($uploadPath)) {
                mkdir($uploadPath, 0777, true); // Buat direktori dengan izin tertinggi
            }

            $namaSertifikat = $sertifikat->getRandomName();
            $sertifikat->move($uploadPath, $namaSertifikat);

            $model = new $this->psikologModel(); // Membuat objek model

            $model->insert([
                'nama'       => esc($this->request->getVar('nama')),
                'email'      => esc($this->request->getVar('email')),
                'password'   => esc($this->request->getVar('password')),
                'no_telepon' => esc($this->request->getVar('no_telepon')),
                'alamat'     => esc($this->request->getVar('alamat')),
                'kelamin'    => esc($this->request->getVar('kelamin')),
                'sertifikat' => $namaSertifikat
            ]);

SELECT *
FROM `psikolog`
WHERE `psikolog`.`id` = '13'
---

        // Ambil data psikolog yang akan diupdate
        $model = new $this->psikologModel();
        $psikolog = $model->find($id);